app/views/articles/_form.html.erb

SELECT "categories".* FROM "categories"
---
          <div class="col-10">
            <%= f.collection_select(:category_ids, Category.all, :id, :name,
                                    { prompt: "Make your selection for the list below(can be empty)" },
                                    { multiple: true, size: 4, class: "custom-select form-control shadow rounded"})%>