app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    @article.user = User.first
    if @article.save
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "SOme title"], ["description", "Some description!"], ["created_at", "2020-12-03 09:00:01.239849"], ["updated_at", "2020-12-03 09:00:01.239849"], ["user_id", 2]]