app/views/categories/index.html.erb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Travel"], ["created_at", "2020-12-09 16:06:35.450880"], ["updated_at", "2020-12-09 16:06:35.450880"]]
---
            <div class="card-footer text-muted">
              <small>Created <%= time_ago_in_words(category.created_at)%> ago,
              Edited <%= time_ago_in_words(category.updated_at)%> ago</small>